app/Models/ModelAuth.php

SELECT *
FROM `tbl_user`
WHERE `username` = 'user'
AND `password` = '8cb2237d0679ca88db6464eac60da96345513964'
AND `level` = '2'
---
 public function LoginUser($username, $password, $level)
  {
   return $this->db->table('tbl_user')
   ->where([
   'username' => $username,
   'password' => $password,
   'level' => $level,
   ])->get()->getRowArray();